IDEA Open Model
ConcreteCheckDetailingEc2.CheckValueShearReinf Property
Compatible with IDEA StatiCa v 10.1
 check value of shear reinforcement
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public double CheckValueShearReinf { get; set; }
Public Property CheckValueShearReinf As Double
	Get
	Set
public:
property double CheckValueShearReinf {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConcreteCheckDetailingEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace